namespace HW.ATC
{
    internal class Program
    {
        // поскольку по условию задачи необходимо взаимодейсвтие абонентов, то 
        // на каждое действие абонента необходимо событие
        // начало звонка - окончание - длительность - абонент 
        // учесть пропущенный звонок (абонент занят)
        // событие на включение/отключение аппарата
        // событие на смену тарифа


        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}